---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyConnectorDeletedWarning
source: html/2c5c0f35-7063-b349-b235-4e02c77d0ac6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyConnectorDeletedWarning Property

The family Connector has been modified so the connection is invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyConnectorDeletedWarning { get; }
```